// Визначити, чи є число a дільником числа b? І навпаки. (Дати дві відповіді)

let a = parseInt(prompt("Введіть перше число:"));
let b = parseInt(prompt("Введіть друге число:"));


if (isNaN(a) || a === "" || a === null || isNaN(b) || b === "" || b === null) {
  alert("Щось пішло не так");
}else if (a % b === 0 && b % a === 0){
  alert(`Числа є дільниками одне одного`)
}else if(a % b === 0){
  alert(`Число ${b} є дільником числа ${a}\nЧисло ${a} не є дільником числа ${b}`)
}else{
  alert(`Число ${a} є дільником числа ${b}\nЧисло ${b} не є дільником числа ${a}`)
}